#+property: header-args:sage :tangle "d5-setup.sage"

* Root system and the Euclidean embedding
#+begin_src sage
  R = RootSystem(CartanType(['D',5]))
  R.root_lattice().dynkin_diagram()
#+end_src

#+RESULTS:
:         O 5
:         |
:         |
: O---O---O---O
: 1   2   3   4   
: D5

We will usually define the central charge in the basis given by the simple roots.
#+begin_src sage
  central_charge = matrix([[-3,1],[-2,1], [-1,1],[7,1],[3,4]])
#+end_src

#+RESULTS:

The following is the change of basis matrix for the Euclidean embedding of D5.
#+begin_src sage
  change_of_basis = matrix([vector(R.ambient_space()(v)) for v in R.root_lattice().simple_roots()])
#+end_src

#+RESULTS:
: [ 1 -1  0  0  0]
: [ 0  1 -1  0  0]
: [ 0  0  1 -1  0]
: [ 0  0  0  1 -1]
: [ 0  0  0  1  1]

This is the central charge in terms of the Euclidean basis (right multiplication)
#+begin_src sage
  central_change_euclidean = change_of_basis.inverse() * central_charge
#+end_src

#+RESULTS:
: [-1  5]
: [ 2  4]
: [ 4  3]
: [ 5  2]
: [-2  2]

